Ran Plan for project: `ecs-with-fargate-and-cicd` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.alb.data.aws_partition.current: Reading...
data.aws_iam_policy_document.codedeploy_assume_role: Reading...
data.aws_iam_policy_document.codepipeline_assume_role: Reading...
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.codedeploy_assume_role: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.codebuild_assume_role: Reading...
data.aws_iam_policy_document.codepipeline_assume_role: Read complete after 0s [id=2245101310]
data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.codebuild_assume_role: Read complete after 0s [id=1229436035]
module.s3_bucket.data.aws_region.current: Reading...
data.aws_route53_zone.this: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=310240692520]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=310240692520]
data.aws_route53_zone.this: Read complete after 1s [id=Z02136633A0BUJO7ZT4W7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.codepipeline_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "codepipeline_policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::310240692520:role/myproject-task-execution-role-staging",
+               "arn:aws:iam::310240692520:role/myproject-task-role-staging",
            ]
        }
+       statement {
+           actions   = [
+               "codestar-connections:UseConnection",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
+       statement {
+           actions   = [
+               "codebuild:BatchGetBuilds",
+               "codebuild:StartBuild",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
+       statement {
+           actions   = [
+               "ecs:RegisterTaskDefinition",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:ecs:us-east-2:310240692520:task-definition/*",
            ]
        }
+       statement {
+           actions   = [
+               "codedeploy:CreateDeployment",
+               "codedeploy:GetApplication",
+               "codedeploy:GetApplicationRevision",
+               "codedeploy:GetDeployment",
+               "codedeploy:GetDeploymentConfig",
+               "codedeploy:RegisterApplicationRevision",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:codedeploy:us-east-2:310240692520:deploymentconfig:CodeDeployDefault.ECSAllAtOnce",
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # aws_appautoscaling_policy.scale_in will be created
+   resource "aws_appautoscaling_policy" "scale_in" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "myproject-ecs-scale-in-staging"
+       policy_type        = "StepScaling"
+       resource_id        = "service/myproject-staging/myproject-staging"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ChangeInCapacity"
+           cooldown                = 600
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_upper_bound = "0"
+               scaling_adjustment          = -2
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_policy.scale_out will be created
+   resource "aws_appautoscaling_policy" "scale_out" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "myproject-ecs-scale-out-staging"
+       policy_type        = "StepScaling"
+       resource_id        = "service/myproject-staging/myproject-staging"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ChangeInCapacity"
+           cooldown                = 120
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_lower_bound = "0"
+               scaling_adjustment          = 2
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_target.this will be created
+   resource "aws_appautoscaling_target" "this" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 5
+       min_capacity       = 2
+       resource_id        = "service/myproject-staging/myproject-staging"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = (known after apply)

+       suspended_state (known after apply)
    }

  # aws_cloudwatch_log_group.app will be created
+   resource "aws_cloudwatch_log_group" "app" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/ecs/myproject/staging/task"
+       name_prefix       = (known after apply)
+       retention_in_days = 7
+       skip_destroy      = false
+       tags              = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all          = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
    }

  # aws_cloudwatch_metric_alarm.cpu_utilization_high will be created
+   resource "aws_cloudwatch_metric_alarm" "cpu_utilization_high" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_name                            = "myproject-high-CPU-utilization-ecs-staging"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanOrEqualToThreshold"
+       dimensions                            = {
+           "ClusterName" = "myproject-staging"
+           "ServiceName" = "myproject-staging"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "CPUUtilization"
+       namespace                             = "AWS/ECS"
+       period                                = 60
+       statistic                             = "Average"
+       tags_all                              = (known after apply)
+       threshold                             = 80
+       treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cpu_utilization_low will be created
+   resource "aws_cloudwatch_metric_alarm" "cpu_utilization_low" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_name                            = "myproject-low-CPU-utilization-ecs-staging"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = {
+           "ClusterName" = "myproject-staging"
+           "ServiceName" = "myproject-staging"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "CPUUtilization"
+       namespace                             = "AWS/ECS"
+       period                                = 60
+       statistic                             = "Average"
+       tags_all                              = (known after apply)
+       threshold                             = 25
+       treat_missing_data                    = "missing"
    }

  # aws_codebuild_project.codebuild will be created
+   resource "aws_codebuild_project" "codebuild" {
+       arn                  = (known after apply)
+       badge_enabled        = false
+       badge_url            = (known after apply)
+       build_timeout        = 60
+       description          = (known after apply)
+       encryption_key       = (known after apply)
+       id                   = (known after apply)
+       name                 = "myproject-staging-build"
+       project_visibility   = "PRIVATE"
+       public_project_alias = (known after apply)
+       queued_timeout       = 480
+       service_role         = (known after apply)
+       tags_all             = (known after apply)

+       artifacts {
+           encryption_disabled    = false
+           override_artifact_name = false
+           type                   = "CODEPIPELINE"
        }

+       environment {
+           compute_type                = "BUILD_GENERAL1_SMALL"
+           image                       = "aws/codebuild/standard:7.0"
+           image_pull_credentials_type = "CODEBUILD"
+           privileged_mode             = true
+           type                        = "LINUX_CONTAINER"

+           environment_variable {
+               name  = "REPOSITORY_URI"
+               type  = "PLAINTEXT"
+               value = (known after apply)
            }
+           environment_variable {
+               name  = "AWS_DEFAULT_REGION"
+               type  = "PLAINTEXT"
+               value = "us-east-2"
            }
+           environment_variable {
+               name  = "IMAGE_REPO_NAME"
+               type  = "PLAINTEXT"
+               value = "myproject-staging-app"
            }
+           environment_variable {
+               name  = "AWS_ACCOUNT_ID"
+               type  = "PLAINTEXT"
+               value = "310240692520"
            }
+           environment_variable {
+               name  = "ENV_PREFIX"
+               type  = "PLAINTEXT"
+               value = "myproject"
            }
+           environment_variable {
+               name  = "ENVIRONMENT"
+               type  = "PLAINTEXT"
+               value = "staging"
            }
+           environment_variable {
+               name  = "TASK_MEMORY"
+               type  = "PLAINTEXT"
+               value = "512"
            }
+           environment_variable {
+               name  = "TASK_CPU"
+               type  = "PLAINTEXT"
+               value = "256"
            }
+           environment_variable {
+               name  = "CONTAINER_PORT"
+               type  = "PLAINTEXT"
+               value = "8080"
            }
        }

+       source {
+           buildspec = "buildspec.yaml"
+           type      = "CODEPIPELINE"
        }
    }

  # aws_codedeploy_app.ecs_app will be created
+   resource "aws_codedeploy_app" "ecs_app" {
+       application_id      = (known after apply)
+       arn                 = (known after apply)
+       compute_platform    = "ECS"
+       github_account_name = (known after apply)
+       id                  = (known after apply)
+       linked_to_github    = (known after apply)
+       name                = "myproject-staging-ecs-app"
+       tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.ecs_deployment_group will be created
+   resource "aws_codedeploy_deployment_group" "ecs_deployment_group" {
+       app_name                    = "myproject-staging-ecs-app"
+       arn                         = (known after apply)
+       compute_platform            = (known after apply)
+       deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
+       deployment_group_id         = (known after apply)
+       deployment_group_name       = "myproject-staging-ecs-deployment-group"
+       id                          = (known after apply)
+       outdated_instances_strategy = "UPDATE"
+       service_role_arn            = (known after apply)
+       tags_all                    = (known after apply)
+       termination_hook_enabled    = false

+       auto_rollback_configuration {
+           enabled = true
+           events  = [
+               "DEPLOYMENT_FAILURE",
            ]
        }

+       blue_green_deployment_config {
+           deployment_ready_option {
+               action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
+           green_fleet_provisioning_option (known after apply)
+           terminate_blue_instances_on_deployment_success {
+               action                           = "TERMINATE"
+               termination_wait_time_in_minutes = 5
            }
        }

+       deployment_style {
+           deployment_option = "WITH_TRAFFIC_CONTROL"
+           deployment_type   = "BLUE_GREEN"
        }

+       ecs_service {
+           cluster_name = "myproject-staging"
+           service_name = "myproject-staging"
        }

+       load_balancer_info {
+           target_group_pair_info {
+               prod_traffic_route {
+                   listener_arns = (known after apply)
                }
+               target_group {
+                   name = "myproject-staging-blue-tg"
                }
+               target_group {
+                   name = "myproject-staging-green-tg"
                }
            }
        }
    }

  # aws_codepipeline.codepipeline will be created
+   resource "aws_codepipeline" "codepipeline" {
+       arn            = (known after apply)
+       execution_mode = "SUPERSEDED"
+       id             = (known after apply)
+       name           = "myproject-staging-pipeline"
+       pipeline_type  = "V1"
+       role_arn       = (known after apply)
+       tags_all       = (known after apply)

+       artifact_store {
+           location = (known after apply)
+           type     = "S3"
            # (1 unchanged attribute hidden)
        }

+       stage {
+           name = "Source"

+           action {
+               category         = "Source"
+               configuration    = (known after apply)
+               name             = "Source"
+               output_artifacts = [
+                   "SourceArt",
                ]
+               owner            = "AWS"
+               provider         = "CodeStarSourceConnection"
+               region           = (known after apply)
+               run_order        = (known after apply)
+               version          = "1"
            }
        }
+       stage {
+           name = "Build"

+           action {
+               category         = "Build"
+               configuration    = {
+                   "ProjectName" = "myproject-staging-build"
                }
+               input_artifacts  = [
+                   "SourceArt",
                ]
+               name             = "Build"
+               output_artifacts = [
+                   "BuildArt",
                ]
+               owner            = "AWS"
+               provider         = "CodeBuild"
+               region           = (known after apply)
+               run_order        = (known after apply)
+               version          = "1"
     
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.